/* Το αρχείο κεφαλίδας πρέπει να περικλείεται σε <>. */
#include stdio.h

int main()
{
    const int c = 3;
    int a, b;
    a = 2;
    float d;
    /* Στην επόμενη σειρά χρειάζεται ερωτηµατικό (;) στο τέλος. */
    d = 4.3
    a = 4 + (b = 2);
    /* Το 3 παρακάτω δεν είναι µεταβλητή, άρα δεν µπορεί να βρίσκεται στα αριστερά του τελεστή ανάθεσης.*/
    3 = a;
    /* Στη c δεν µπορεί στη παρακάτω σειρά να ανατεθεί τιµή διότι έχει δηλωθεί ως const (µόνο ανάγνωσης). */
    c = c + b ;

    return 0;
}