// Το όνοµα του αρχείου πρέπει να περικλείεται σε <>.
#include stdio.h

#define ONE 1
#define TWO 2
// ∆εν επιτρέπονται ονόµατα σταθερών στα Ελληνικά.
#define ΤΕΣΣΕΡΑ 4

// H main() θα πρέπει να δηλωθεί ως τύπου int.
main()
{
    // ∆εν επιτρέπονται ονόµατα µεταβλητών στα Ελληνικά.
    int c = 3, a, b, γ;
    // Η µεταβλητή c έχει ξαναδηλωθεί. ∆εν µπορούµε να έχουµε // δύο µεταβλητές µε το ίδιο όνοµα!
    float c = 5.6;
    b = ONE + TWO;
    a = printf("Hello World!");
    // Η συµβολοσειρά Τέλος έπρεπει να περικλείεται σε διπλά
    // εισαγωγικά "Τέλος" και όχι µονά.
    printf('Telos');
    return 0;
}